{
  "name": "API Whitelist",

  "namespace":"Stanford\\ApiWhitelist",

  "description": "Provides additional restrictions on an otherwise open API",

  "versions": [
    { "0.1": "Initial" }
  ],

  "authors": [
    {
      "name": "Andrew Martin",
      "email": "andy123@stanford.edu",
      "institution": "Stanford University"
    }
  ],

  "permissions": [
    "redcap_every_page_before_render",
    "redcap_module_system_enable",
    "redcap_module_link_check_display",
    "redcap_module_save_configuration"
  ],

  "enable-every-page-hooks-on-system-pages": true,

  "no-auth-pages": [
  ],

  "links": {
    "control-center": [
      {
        "name": "API Whitelist",
        "icon": "gear",
        "url": "config.php"
      }
    ],
    "project": [
    ]
  },

  "system-settings": [
    {
      "key": "instructions",
      "name": "<h5><b>Description</b></h5><p>The API Whitelist allows you to restrict API access based on IP address, project, or username.  We use it to allow our internal network to access the API but external IPs require a specific whitelist rule, provided by completion of a survey.</p><p>Examples for whitelist rules are: your VPN network range, a single external server's IP address for a collaborator, or a specific project & user that wants REDCap Mobile access deployed abroad.</p><p>If this is your first time enabling this module, you will have to create the API Whitelist Configuration project.  A template and instructions can be found by clicking on the 'API Whitelist Setup' link on the left sidebar of the control center for instructions.</p><br><div class='alert alert-secondary'><i>This module, once enabled and configured, will apply a filter to all API requests for all projects.</i></div>",
      "type": "descriptive"
    },
    {
      "key": "config-pid",
      "name": "<b>API Whitelist Configuration Project</b><br>This module stores all whitelist rules in a redcap project.  This is how you will add/edit rules once enabled.",
      "required": false,
      "type": "project-id",
      "source": "js/api_whitelist.js",
      "functionName": "ApiWhitelist.config"
    },
    {
      "key": "rejection-message",
      "name": "<b>Rejection Help Message</b><br>When a request does not match a whitelist rule, the user will receive a 403 response and the text entered here.<br>For example, you might give directions to a survey to request an exception:<div class='m3'>API Access Requires Approval<br>In order to use this API from your current network, you must request permission by completing this form:  https://link.to.your.survey",
      "required": true,
      "type": "textarea"
    },
    {
      "key": "configuration-validation-errors",
      "name": "",
      "required": false,
      "readonly": true,
      "type": "text"
    },
    {
      "key": "whitelist-logging-option",
      "name": "<b>API Whitelist Logging Options</b><br>You can log all api attempts through one of these options:<br><ol><li>No Logging</li><li>Database Table: A new table will be added to your schema that records each api call, the user, the project, ip, and duration.  This is a great way to identify who is using your API and how much 'cpu-time' they are spending.  This is the recommended option.</li><li>REDCap Log Events: this will add to the default logging table for REDCap - it could add a substantial volume over time and is somewhat difficult to parse/query as details will be stored as json object.</li></ol><i>Note: If you install the emLogger EM, you will automatically get logging to file as configured in your emLogger.  You can clear/rotate the log file anytime you like</i>",
      "required": true,
      "type": "radio",
      "choices":[
        {
          "name" : "0. No Logging",
          "value" : "0"
        },
        {
          "name" : "1. Custom Table <small><sup>*</sup>Recommended</small>",
          "value" : "1"
        },
        {
          "name" : "2. REDCap Event Logging",
          "value" : "2"
        }
      ]
    },
    {
      "key": "enable-system-debug-logging",
      "name": "<b>Enable Debug Logging</b><br>If you have the Stanford emLogger external module installed and configured, you can enable additional debug-level logging through this checkbox</b>",
      "required": false,
      "type": "checkbox"
    }

  ],

  "project-settings": [
  ]
}
